Revit 2027 API
UIFabricationUtils.SetOpenConnectorIndicatorPlanColor Method
 Sets the color of the open connector indicator in plan view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetOpenConnectorIndicatorPlanColor(
	Color color
)
Public Shared Sub SetOpenConnectorIndicatorPlanColor (
	color As Color
)
public:
static void SetOpenConnectorIndicatorPlanColor(
	Color^ color
)
static member SetOpenConnectorIndicatorPlanColor :
        color : Color -> unit
Parameters
color Color
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UIFabricationUtils Class
Autodesk.Revit.UI Namespace